
{
  "title":"Tools",
  "content":"This section provides direct links to all of the interactive exercises referenced within the text, as well as Java® applet tools and real data relevant to the course\u0026rsquo;s main concepts, such as \u0026ldquo;Trussworks,\u0026rdquo; a matrix analysis tool for truss structures, \u0026ldquo;Frameworks,\u0026rdquo; a similar tool for frame structures, and \u0026ldquo;Steel Sections,\u0026rdquo; a database of steel beam sections.\nInteractive Exercises Vector Addition\nThe goal of this exercise is to estimate the resultant of the addition of two vectors. You will be awarded points depending on the accuracy of your estimate and the size of the error tolerance you allow. An estimate within a smaller error tolerance awards you more points, but is, of course, harder to do. You win the game when you get at least 100 points.\nSliding Block\nYour mission is to find an equilibrium state for a block on an inclined plane. To achieve your goal, you can modify three parameters: the coefficient of friction, the shape of the block and the angle theta.\nReactions\nRandom loads on a truss structure are generated by the program, and you are asked to estimate the reactions that would be generated at the supports. This tests your knowledge of the principles of vector addition and the summation of forces around a point. You can choose an error tolerance for your estimates, but keep in mind that you get more points for a correct answer within a lower tolerance. Try and get to 100 points with as few tries as possible.\nBeam Moments\nThe goal of this exercise is to reach an equilibrium position when loading a beam. The program first lets you decide the number of loads to add to a beam and then lets you choose whether or not you want to position the supports. If you do not position the supports, the program will generate random positions for them. Once your beam is set up, you can start to load the beam.\nPoint Load\nThe goal of the exercise is to show the effect on the shear force and bending moment distribution of \u0026ldquo;smoothing\u0026rdquo; out the distribution of a load acting at a point on the beam.\nReal Tools and Data Trussworks\nTrussworks allows users to easily create and analyze 2D Structures using the Direct Stiffness Method. It models truss structures that can carry axial loads. The click and drag interface lets you input two-dimensional structures, but the program can take in and perform calculations for three-dimensional structures as well using a text based XML input.\nFrameworks\nFrameworks allows users to easily create and analyze 2D Structures using the Direct Stiffness Method. It models general framed structures that can carry and transfer shear forces and moments as well as axial loads. The click and drag interface lets you input two-dimensional structures, but the program can take in and perform calculations for three-dimensional structures as well using a text based XML input (see Section 4). Also included is a database of steel cross-sections and their corresponding geometric properties developed by a colleague and adapted for the programs, as well as material properties of the most commonly used engineering materials.\nSteel Sections\nThis program provides users with a database of searchable steel cross-sections and their corresponding geometric properties.\n"}


